vke/nrf52840_entry_door_router_thread/efekta_mini_dev_board/s140/config/efekta_mini_dev_board.h
#ifndef EFEKTA_DEV_BOARD_H
#define EFEKTA_DEV_BOARD_H

#ifdef __cplusplus
extern "C" {
#endif

#include "nrf_gpio.h"

// LED definitions for EFEKTA_DEV_BOARD_H
// Each LED color is considered a separate LED
#define LEDS_NUMBER    4

#define LED1_B         NRF_GPIO_PIN_MAP(0,6)
#define LED2_R         NRF_GPIO_PIN_MAP(0,8)
#define LED2_G         NRF_GPIO_PIN_MAP(1,9)
#define LED2_B         NRF_GPIO_PIN_MAP(0,12)

#define PSU_12V_SENSE_PIN NRF_GPIO_PIN_MAP(0,28)

#define LED_1          LED1_B
#define LED_2          LED2_R
#define LED_3          LED2_G
#define LED_4          LED2_B

#define LEDS_ACTIVE_STATE 0

#define LEDS_LIST { LED_1, LED_2, LED_3, LED_4 }

#define LEDS_INV_MASK  LEDS_MASK

#define BSP_LED_0      LED_1
#define BSP_LED_1      LED_2
#define BSP_LED_2      LED_3
#define BSP_LED_3      LED_4

#define BUTTONS_NUMBER 4

#define BUTTON_1       NRF_GPIO_PIN_MAP(1, 6) // key
#define BUTTON_2       NRF_GPIO_PIN_MAP(1, 10) // door bell
#define BUTTON_3       NRF_GPIO_PIN_MAP(1, 11) // close event
#define BUTTON_4       NRF_GPIO_PIN_MAP(0, 31) // open event
#define BUTTON_PULL    NRF_GPIO_PIN_PULLUP

#define BUTTONS_ACTIVE_STATE 0

#define BUTTONS_LIST { BUTTON_1, BUTTON_2, BUTTON_3, BUTTON_4 }

#define BSP_BUTTON_0   BUTTON_1
#define BSP_BUTTON_1   BUTTON_2
#define BSP_BUTTON_2   BUTTON_3
#define BSP_BUTTON_3   BUTTON_4

#define BSP_SELF_PINRESET_PIN NRF_GPIO_PIN_MAP(0, 19)

#define HWFC           true

#ifdef __cplusplus
}
#endif

#endif // EFEKTA_DEV_BOARD_H
